[{"area": "Computer Science", "topic": "data structures", "level0": "Doesn't know the difference between Array and LinkedList", "level1": "Able to explain and use Arrays, LinkedLists, Dictionaries etc in practical programming tasks", "level2": "Knows space and time tradeoffs of the basic data structures, Arrays vs LinkedLists, Able to explain how hashtables can be implemented and can handle collisions, Priority queues and ways to implement them etc.", "level3": "Knowledge of advanced data structures like B-trees, binomial and fibonacci heaps, AVL/Red Black trees, Splay Trees, Skip Lists, tries etc."}, {"area": "Computer Science", "topic": "algorithms", "level0": "Unable to find the average of numbers in an array (It's hard to believe but I've interviewed such candidates) ", "level1": "Basic sorting, searching and data structure traversal and retrieval algorithms ", "level2": "Tree, Graph, simple greedy and divide and conquer algorithms, is able to understand the relevance of the levels of this matrix. ", "level3": "Able to recognize and code dynamic programming solutions, good knowledge of graph algorithms, good knowledge of numerical computation algorithms, able to identify NP problems etc. "}, {"area": "Computer Science", "topic": "systems programming", "level0": "Doesn't know what a compiler, linker or interpreter is", "level1": "Basic understanding of compilers, linker and interpreters. Understands what assembly code is and how things work at the hardware level. Some knowledge of virtual memory and paging.", "level2": "Understands kernel mode vs. user mode, multi-threading, synchronization primitives and how they're implemented, able to read assembly code. Understands how networks work, understanding of network protocols and socket level programming.", "level3": "Understands the entire programming stack, hardware (CPU + Memory + Cache + Interrupts + microcode), binary code, assembly, static and dynamic linking, compilation, interpretation, JIT compilation, garbage collection, heap, stack, memory addressing..."}, {"area": "Software Engineering", "topic": "source code version control", "level0": "Folder backups by date", "level1": "VSS and beginning CVS/SVN user", "level2": "Proficient in using CVS and SVN features. Knows how to branch and merge, use patches setup repository properties etc.", "level3": "Knowledge of distributed VCS systems. Has tried out Bzr/Mercurial/Darcs/Git"}, {"area": "Software Engineering", "topic": "build automation", "level0": "Only knows how to build from IDE", "level1": "Knows how to build the system from the command line", "level2": "Can setup a script to build the basic system", "level3": "Can setup a script to build the system and also documentation, installers, generate release notes and tag the code in source control"}, {"area": "Software Engineering", "topic": "automated testing", "level0": "Thinks that all testing is the job of the tester", "level1": "Has written automated unit tests and comes up with good unit test cases for the code that is being written", "level2": "Has written code in TDD manner", "level3": "Understands and is able to setup automated functional, load/performance and UI tests"}, {"area": "Programming", "topic": "problem decomposition", "level0": "Only straight line code with copy paste for reuse", "level1": "Able to break up problem into multiple functions", "level2": "Able to come up with reusable functions/objects that solve the overall problem", "level3": "Use of appropriate data structures and algorithms and comes up with generic/object-oriented code that encapsulate aspects of the problem that are subject to change."}, {"area": "Programming", "topic": "systems decomposition", "level0": "Not able to think above the level of a single file/class", "level1": "Able to break up problem space and design solution as long as it is within the same platform/technology", "level2": "Able to design systems that span multiple technologies/platforms.", "level3": "Able to visualize and design complex systems with multiple product lines and integrations with external systems. Also should be able to design operations support systems like monitoring, reporting, fail overs etc."}, {"area": "Programming", "topic": "communication", "level0": "Cannot express thoughts/ideas to peers. Poor spelling and grammar.", "level1": "Peers can understand what is being said. Good spelling and grammar.", "level2": "Is able to effectively communicate with peers", "level3": "Able to understand and communicate thoughts/design/ideas/specs in a unambiguous manner and adjusts communication as per the context"}, {"area": "Programming", "topic": "code organization within a file", "level0": "no evidence of organization within a file", "level1": "Methods are grouped logically or by accessibility", "level2": "Code is grouped into regions and well commented with references to other source files", "level3": "File has license header, summary, well commented, consistent white space usage. The file should look beautiful."}, {"area": "Programming", "topic": "code organization across files", "level0": "No thought given to organizing code across files", "level1": "Related files are grouped into a folder", "level2": "Each physical file has a unique purpose, for e.g. one class definition, one feature implementation etc.", "level3": "Code organization at a physical level closely matches design and looking at file names and folder distribution provides insights into design"}, {"area": "Programming", "topic": "source tree organization", "level0": "Everything in one folder", "level1": "Basic separation of code into logical folders.", "level2": "No circular dependencies, binaries, libs, docs, builds, third-party code all organized into appropriate folders", "level3": "Physical layout of source tree matches logical hierarchy and organization.  The directory names and organization provide insights into the design of the system."}, {"area": "Programming", "topic": "code readability", "level0": "Mono-syllable names", "level1": "Good names for files, variables classes, methods etc.", "level2": "No long functions, comments explaining unusual code, bug fixes, code assumptions", "level3": "Code assumptions are verified using asserts, code flows naturally - no deep nesting of conditionals or methods"}, {"area": "Programming", "topic": "defensive coding", "level0": "Doesn't understand the concept", "level1": "Checks all arguments and asserts critical assumptions in code", "level2": "Makes sure to check return values and check for exceptions around code that can fail.", "level3": "Has his own library to help with defensive coding, writes unit tests that simulate faults"}, {"area": "Programming", "topic": "error handling", "level0": "Only codes the happy case", "level1": "Basic error handling around code that can throw exceptions/generate errors", "level2": "Ensures that error/exceptions leave program in good state, resources, connections and memory is all cleaned up properly", "level3": "Codes to detect possible exception before, maintain consistent exception handling strategy in all layers of code, come up with guidelines on exception handling for entire system."}, {"area": "Programming", "topic": "IDE", "level0": "Mostly uses IDE for text editing", "level1": "Knows their way around the interface, able to effectively use the IDE using menus.", "level2": "Knows keyboard shortcuts for most used operations.", "level3": "Has written custom macros"}, {"area": "Programming", "topic": "API", "level0": "Needs to look up the documentation frequently", "level1": "Has the most frequently used APIs in memory", "level2": "Vast and In-depth knowledge of the API", "level3": "Has written libraries that sit on top of the API to simplify frequently used tasks and to fill in gaps in the API"}, {"area": "Programming", "topic": "frameworks", "level0": "Has not used any framework outside of the core platform", "level1": "Has heard about but not used the popular frameworks available for the platform.", "level2": "Has used more than one framework in a professional capacity and is well-versed with the idioms of the frameworks.", "level3": "Author of framework"}, {"area": "Programming", "topic": "requirements", "level0": "Takes the given requirements and codes to spec", "level1": "Come up with questions regarding missed cases in the spec", "level2": "Understand complete picture and come up with entire areas that need to be speced", "level3": "Able to suggest better alternatives and flows to given requirements based on experience"}, {"area": "Programming", "topic": "scripting", "level0": "No knowledge of scripting tools", "level1": "Batch files/shell scripts", "level2": "Perl/Python/Ruby/VBScript/Powershell", "level3": "Has written and published reusable code"}, {"area": "Programming", "topic": "database", "level0": "Thinks that Excel is a database", "level1": "Knows basic database concepts, normalization, ACID, transactions and can write simple selects", "level2": "Able to design good and normalized database schemas keeping in mind the queries that'll have to be run, proficient in use of views, stored procedures, triggers and user defined types. Knows difference between clustered and non-clustered indexes. Proficient in use of ORM tools.", "level3": "Can do basic database administration, performance optimization, index optimization, write advanced select queries, able to replace cursor usage with relational sql, understands how data is stored internally, understands how indexes are stored internally, understands how databases can be mirrored, replicated etc. Understands how the two phase commit works."}, {"area": "Knowledge", "topic": "tool knowledge", "level0": "Limited to primary IDE (VS.Net, Eclipse etc.)", "level1": "Knows about some alternatives to popular and standard tools.", "level2": "Good knowledge of editors, debuggers, IDEs, open source alternatives etc.  etc. For e.g. someone who knows most of the tools from Scott Hanselman's power tools list. Has used ORM tools.", "level3": "Has actually written tools and scripts, added bonus if they've been published."}, {"area": "Knowledge", "topic": "languages exposed to", "level0": "Imperative or Object Oriented", "level1": "Imperative, Object-Oriented and declarative (SQL), added bonus if they understand static vs dynamic typing, weak vs strong typing and static inferred types", "level2": "Functional, added bonus if they understand lazy evaluation, currying, continuations", "level3": "Concurrent (Erlang, Oz) and Logic (Prolog)"}, {"area": "Knowledge", "topic": "codebase knowledge", "level0": "Has never looked at the codebase", "level1": "Basic knowledge of the code layout and how to build the system", "level2": "Good working knowledge of code base, has implemented several bug fixes and maybe some small features.", "level3": "Has implemented multiple big features in the codebase and can easily visualize the changes required for most features or bug fixes."}, {"area": "Knowledge", "topic": "knowledge of upcoming technologies", "level0": "Has not heard of the upcoming technologies", "level1": "Has heard of upcoming technologies in the field", "level2": "Has downloaded the alpha preview/CTP/beta and read some articles/manuals", "level3": "Has played with the previews and has actually built something with it and as a bonus shared that with everyone else"}, {"area": "Knowledge", "topic": "platform internals", "level0": "Zero knowledge of platform internals", "level1": "Has basic knowledge of how the platform works internally", "level2": "Deep knowledge of platform internals and can visualize how the platform takes the program and converts it into executable code.", "level3": "Has written tools to enhance or provide information on platform internals.  For e.g. disassemblers, decompilers, debuggers etc."}, {"area": "Knowledge", "topic": "books", "level0": "Unleashed series, 21 days series, 24 hour series, dummies series...", "level1": "Code Complete, Don't Make me Think, Mastering Regular Expressions", "level2": "Design Patterns, Peopleware, Programming Pearls, Algorithm Design Manual, Pragmatic Programmer, Mythical Man month", "level3": "Structure and Interpretation of Computer Programs, Concepts Techniques, Models of Computer Programming, Art of Computer Programming, Database systems , by C. J Date, Thinking Forth, Little Schemer"}, {"area": "Knowledge", "topic": "blogs", "level0": "Has heard of them but never got the time.", "level1": "Reads tech/programming/software engineering blogs and listens to podcasts regularly.", "level2": "Maintains a link blog with some collection of useful articles and tools that he/she has collected", "level3": "Maintains a blog in which personal insights and thoughts on programming are shared"}, {"area": "Experience", "topic": "languages with professional experience", "level0": "Imperative or Object Oriented", "level1": "Imperative, Object-Oriented and declarative (SQL), added bonus if they understand static vs dynamic typing, weak vs strong typing and static inferred types", "level2": "Functional, added bonus if they understand lazy evaluation, currying, continuations", "level3": "Concurrent (Erlang, Oz) and Logic (Prolog)"}, {"area": "Experience", "topic": "platforms with professional experience", "level0": "1", "level1": "2-3", "level2": "4-5", "level3": "6+"}, {"area": "Experience", "topic": "years of professional experience", "level0": "1", "level1": "2-5", "level2": "6-9", "level3": "10+"}, {"area": "Experience", "topic": "domain knowledge", "level0": "No knowledge of the domain", "level1": "Has worked on at least one product in the domain.", "level2": "Has worked on multiple products in the same domain.", "level3": "Domain expert. Has designed and implemented several products/solutions in the domain. Well versed with standard terms, protocols used in the domain."}]
